Обработки/Reports/_РасшифровкаИнформацииОКредитныхРейтингах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаИнформацииОКредитныхРейтингах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаИнформацииОКредитныхРейтингах/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	//возьмем настройки из Баланса, чтобы распределять результат по строкам: 
	НастройкиОтчета = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Отчет.Период, Отчет.СчетДоверительногоУправления, "РегламентированныйОтчетБаланс");
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтотОбъект.Результат, НастройкиОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда) 
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	КомандаСформироватьНаСервере(); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат); 

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Отчет.СчетДоверительногоУправления = Параметры.СчетДоверительногоУправления; 
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.Период = Параметры.Период;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Отчет.Период) Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры
